<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>Главная страница блога</title>
<link href="style.css" rel="stylesheet" type="text/css" />
</head>

<body>
<table width="690" border="0" align="center" class="main_border" cellpadding="0" cellspacing="0" bgcolor="#FFFFFF">
  <tr>
    <td><img src="img/header.jpg" width="690" height="100" /></td>
  </tr>
  <tr>
    <td height="34" valign="top"><table width="100%" border="0">
      <tr>
        <td width="182" height="30" valign="top" class="left">&nbsp;</td>
        <td><p>Специальные программы просмотра HTML-документов, которые часто называют браузерами, служат для интерпретации файлов, размеченных по правилам языка HTML, форматирования их в виде Web-страниц и отображении их содержимого на экране компьютера пользователя. Существует большое количество программ-браузеров, разработанных различными компаниями, однако, на сегодняшний день из всего разнообразия программ явно выделяются две программы-лидера &mdash; Netscape Communicator и Microsoft Internet Explorer.</p>
          <p><img src="files/060515/colors/12.jpg" width="300" height="300" /></p>
          <p>Программа Netscape Navigator разработана компанией Netscape Communications Corporation. Как и у многих программных продуктов, существует ряд версий этой программы. Последней версией программы Netscape Communicator на момент написания книги являлась версия 4.7. Программа Internet Explorer разработана компанией Microsoft. Последняя версия этой программы &mdash; 5.0.</p>
          <p>Другие браузеры значительно отстают по популярности. Несколько лет назад браузер компании Netscape занимал ведущее место среди браузеров, более двух третей пользователей применяли именно эту программу просмотра. Выпустив свой браузер, компания Microsoft приложила огромные усилия для завоевания этой части рынка. В средствах массовой информации часто</p>
          <p>встречались сообщения о войне между браузерами за пользователей. Сейчас эти два браузера сравнимы по популярности. Росту популярности браузера Microsoft способствует включение браузера в состав операционной системы Windows 98, однако, в конечном счете, выбор браузера остается за пользователем.</p>
          <p>Современные браузеры обладают широкими возможностями, но основным для них является интерпретация документов, размеченных по правилам HTML. Описанию этих правил, в основном, и посвящена данная книга. В первой части мы рассмотрим лишь основополагающие принципы построения HTML-документов.</p>
          <p>Чтобы понять, что собой представляет язык разметки, вспомним старые добрые времена, когда многие работали с текстовыми редакторами типа WordStar. В них для выделения какой-либо фразы, например, полужирным шрифтом, в ее начале и в конце ставились специальные отметки (/<span lang="en-us" xml:lang="en-us">B</span>&nbsp;и /<span lang="en-us" xml:lang="en-us">b</span>).</p></td>
      </tr>
    </table></td>
  </tr>
  <tr>
    <td height="31"><img src="img/footer.jpg" width="690" height="20" /></td>
  </tr>
</table>
</body>
</html>